<!-- attach-outputs:plan-nodes-prod.txt -->
  <!-- Output: plan-nodes-prod.txt -->
  #### plan-nodes-prod.txt 📖: `test: success, prod: success`

  **Last updated:** Jan 28, 2026, 03:14 AM UTC

  <details><summary>Show Contents</summary>

  ```

  
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.cluster.module.talos-vm["tiles-cp-1"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7211"
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          ~ "C6:D4:EB:45:4D:2A" -> "66:94:E3:CB:B4:5F",
          ~ "32:C2:CC:99:51:A1" -> "1A:32:F8:8F:68:67",
            "00:00:00:00:00:00",
            # (4 unchanged elements hidden)
        ]
        name                                 = "tiles-cp-1"
        tags                                 = []
        # (33 unchanged attributes hidden)

      ~ cpu {
          + flags        = []
            # (9 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-2"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7212"
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          ~ "D6:AD:EB:C1:FF:0C" -> "BA:DC:1F:24:6F:BE",
          ~ "72:8B:FD:86:BF:E5" -> "8A:5E:18:06:90:4A",
            "00:00:00:00:00:00",
            # (4 unchanged elements hidden)
        ]
        name                                 = "tiles-cp-2"
        tags                                 = []
        # (33 unchanged attributes hidden)

      ~ cpu {
          + flags        = []
            # (9 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-3"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7213"
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          ~ "E2:80:82:E3:58:7C" -> "CA:B1:DB:1F:05:1E",
          ~ "FA:2B:8D:8D:40:6B" -> "92:51:89:83:5B:1E",
            "00:00:00:00:00:00",
            # (4 unchanged elements hidden)
        ]
        name                                 = "tiles-cp-3"
        tags                                 = []
        # (33 unchanged attributes hidden)

      ~ cpu {
          + flags        = []
            # (9 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-1"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7221"
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          ~ "5A:F9:01:E9:FA:61" -> "52:68:2B:77:FE:FC",
          ~ "32:CC:C0:9B:08:7A" -> "1A:8E:4D:55:5B:CE",
            "00:00:00:00:00:00",
            # (4 unchanged elements hidden)
        ]
        name                                 = "tiles-wk-1"
        tags                                 = []
        # (33 unchanged attributes hidden)

      ~ cpu {
          + flags        = []
            # (9 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-2"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7222"
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          ~ "DE:60:1F:72:0D:BE" -> "52:15:9F:7E:EA:F5",
          ~ "5A:51:8D:C7:5A:5A" -> "A6:86:BC:E2:80:5A",
            "00:00:00:00:00:00",
            # (4 unchanged elements hidden)
        ]
        name                                 = "tiles-wk-2"
        tags                                 = []
        # (33 unchanged attributes hidden)

      ~ cpu {
          + flags        = []
            # (9 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-3"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7223"
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          ~ "EA:F6:EB:07:22:7E" -> "12:0D:92:5E:DD:56",
          ~ "E6:15:93:FC:A5:C9" -> "DA:B8:D0:A8:0B:68",
            "00:00:00:00:00:00",
            # (4 unchanged elements hidden)
        ]
        name                                 = "tiles-wk-3"
        tags                                 = []
        # (33 unchanged attributes hidden)

      ~ cpu {
          + flags        = []
            # (9 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cluster.talos_machine_bootstrap.this is tainted, so must be replaced
-/+ resource "talos_machine_bootstrap" "this" {
      ~ id                   = "machine_bootstrap" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-1"].proxmox_virtual_environment_vm.main is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "main" {
      ~ boot_order                           = [
          - "ide2",
          - "scsi0",
          - "net0",
        ] -> (known after apply)
      + hotplug                              = (known after apply)
      ~ id                                   = "7211" -> (known after apply)
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.128.11",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed0:7211",
            ],
        ] -> (known after apply)
      ~ mac_addresses                        = [
          - "00:00:00:00:00:00",
          - "66:94:E3:CB:B4:5F",
          - "1A:32:F8:8F:68:67",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:D0:72:11",
        ] -> (known after apply)
        name                                 = "tiles-cp-1"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
        ] -> (known after apply)
        tags                                 = []
        # (29 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
          ~ units        = 0 -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-7211-disk-0" -> (known after apply)
            # (14 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
            # (10 unchanged attributes hidden)
        }

      ~ vga (known after apply)

        # (4 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-1"].talos_machine_configuration_apply.this will be replaced due to changes in replace_triggered_by
-/+ resource "talos_machine_configuration_apply" "this" {
      ~ id                          = "machine_configuration_apply" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-2"].proxmox_virtual_environment_vm.main is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "main" {
      ~ boot_order                           = [
          - "ide2",
          - "scsi0",
          - "net0",
        ] -> (known after apply)
      + hotplug                              = (known after apply)
      ~ id                                   = "7212" -> (known after apply)
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.128.12",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed0:7212",
            ],
        ] -> (known after apply)
      ~ mac_addresses                        = [
          - "00:00:00:00:00:00",
          - "BA:DC:1F:24:6F:BE",
          - "8A:5E:18:06:90:4A",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:D0:72:12",
        ] -> (known after apply)
        name                                 = "tiles-cp-2"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
        ] -> (known after apply)
        tags                                 = []
        # (29 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
          ~ units        = 0 -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-7212-disk-0" -> (known after apply)
            # (14 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
            # (10 unchanged attributes hidden)
        }

      ~ vga (known after apply)

        # (4 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-2"].talos_machine_configuration_apply.this will be replaced due to changes in replace_triggered_by
-/+ resource "talos_machine_configuration_apply" "this" {
      ~ id                          = "machine_configuration_apply" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-3"].proxmox_virtual_environment_vm.main is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "main" {
      ~ boot_order                           = [
          - "ide2",
          - "scsi0",
          - "net0",
        ] -> (known after apply)
      + hotplug                              = (known after apply)
      ~ id                                   = "7213" -> (known after apply)
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.128.13",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed0:7213",
            ],
        ] -> (known after apply)
      ~ mac_addresses                        = [
          - "00:00:00:00:00:00",
          - "CA:B1:DB:1F:05:1E",
          - "92:51:89:83:5B:1E",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:D0:72:13",
        ] -> (known after apply)
        name                                 = "tiles-cp-3"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
        ] -> (known after apply)
        tags                                 = []
        # (29 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
          ~ units        = 0 -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-7213-disk-0" -> (known after apply)
            # (14 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
            # (10 unchanged attributes hidden)
        }

      ~ vga (known after apply)

        # (4 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-3"].talos_machine_configuration_apply.this will be replaced due to changes in replace_triggered_by
-/+ resource "talos_machine_configuration_apply" "this" {
      ~ id                          = "machine_configuration_apply" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-1"].proxmox_virtual_environment_vm.main is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "main" {
      ~ boot_order                           = [
          - "ide2",
          - "scsi0",
          - "net0",
        ] -> (known after apply)
      + hotplug                              = (known after apply)
      ~ id                                   = "7221" -> (known after apply)
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.128.21",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed0:7221",
            ],
        ] -> (known after apply)
      ~ mac_addresses                        = [
          - "00:00:00:00:00:00",
          - "52:68:2B:77:FE:FC",
          - "1A:8E:4D:55:5B:CE",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:D0:72:21",
        ] -> (known after apply)
        name                                 = "tiles-wk-1"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
        ] -> (known after apply)
        tags                                 = []
        # (29 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
          ~ units        = 0 -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-7221-disk-0" -> (known after apply)
            # (14 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
            # (10 unchanged attributes hidden)
        }

      ~ vga (known after apply)

        # (4 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-1"].talos_machine_configuration_apply.this will be replaced due to changes in replace_triggered_by
-/+ resource "talos_machine_configuration_apply" "this" {
      ~ id                          = "machine_configuration_apply" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-2"].proxmox_virtual_environment_vm.main is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "main" {
      ~ boot_order                           = [
          - "ide2",
          - "scsi0",
          - "net0",
        ] -> (known after apply)
      + hotplug                              = (known after apply)
      ~ id                                   = "7222" -> (known after apply)
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.128.22",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed0:7222",
            ],
        ] -> (known after apply)
      ~ mac_addresses                        = [
          - "00:00:00:00:00:00",
          - "52:15:9F:7E:EA:F5",
          - "A6:86:BC:E2:80:5A",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:D0:72:22",
        ] -> (known after apply)
        name                                 = "tiles-wk-2"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
        ] -> (known after apply)
        tags                                 = []
        # (29 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
          ~ units        = 0 -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-7222-disk-0" -> (known after apply)
            # (14 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
            # (10 unchanged attributes hidden)
        }

      ~ vga (known after apply)

        # (4 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-2"].talos_machine_configuration_apply.this will be replaced due to changes in replace_triggered_by
-/+ resource "talos_machine_configuration_apply" "this" {
      ~ id                          = "machine_configuration_apply" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-3"].proxmox_virtual_environment_vm.main is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "main" {
      ~ boot_order                           = [
          - "ide2",
          - "scsi0",
          - "net0",
        ] -> (known after apply)
      + hotplug                              = (known after apply)
      ~ id                                   = "7223" -> (known after apply)
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.128.23",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed0:7223",
            ],
        ] -> (known after apply)
      ~ mac_addresses                        = [
          - "00:00:00:00:00:00",
          - "12:0D:92:5E:DD:56",
          - "DA:B8:D0:A8:0B:68",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:D0:72:23",
        ] -> (known after apply)
        name                                 = "tiles-wk-3"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
        ] -> (known after apply)
        tags                                 = []
        # (29 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
          ~ units        = 0 -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-7223-disk-0" -> (known after apply)
            # (14 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
            # (10 unchanged attributes hidden)
        }

      ~ vga (known after apply)

        # (4 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-3"].talos_machine_configuration_apply.this will be replaced due to changes in replace_triggered_by
-/+ resource "talos_machine_configuration_apply" "this" {
      ~ id                          = "machine_configuration_apply" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 13 to add, 0 to change, 13 to destroy.

  ```

  </details>
  
  